arjunsk/E88_Wifi_cam_drone_control/ESP32Drone/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include <Arduino.h>
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "drone_index.h"
#include "board_config.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  int throttle;
  int yaw;
  int pitch;
  int roll;
  int emergency;
  int takeoff;
  int land;
  int calibrate;
} drone_state_t;

static drone_state_t drone_state = {
  .throttle = 0,
  .yaw = 0,
  .pitch = 0,
  .roll = 0,
  .emergency = 0,
  .takeoff = 0,
  .land = 0,
  .calibrate = 0
};

static bool drone_tx_task_started = false;
static uint8_t drone_flags_legacy = 0;
static uint8_t drone_oneshot_takeoff = 0;
static uint8_t drone_oneshot_land = 0;
static uint8_t drone_oneshot_emergency = 0;
static uint8_t drone_oneshot_calibrate = 0;
static uint32_t drone_tx_active_until_ms = 0;
static bool drone_tx_has_activity = false;
// Match keyboard_control.py behavior: continuous keepalive at 25Hz.
static bool drone_keepalive_mode = true;

static uint8_t drone_sanitize_axis(uint8_t value) {
  if (value == 0x66 || value == 0x99) {
    return (uint8_t)(value + 1);
  }
  return value;
}

static uint8_t drone_axis_centered_from_percent(int value) {
  if (value < -100) {
    value = -100;
  } else if (value > 100) {
    value = 100;
  }
  int mapped = (int)roundf(((float)(value + 100) * 255.0f) / 200.0f);
  return drone_sanitize_axis((uint8_t)mapped);
}

static uint8_t drone_throttle_from_percent(int value) {
  if (value < 0) {
    value = 0;
  } else if (value > 100) {
    value = 100;
  }
  int mapped = (int)roundf(((float)value * 255.0f) / 100.0f);
  return (uint8_t)mapped;
}

static uint8_t drone_checksum_legacy(const uint8_t *payload) {
  uint8_t chk = payload[1];
  for (int i = 2; i <= 5; i++) {
    chk ^= payload[i];
  }
  return drone_sanitize_axis(chk);
}

static void drone_activate_tx(uint32_t hold_ms) {
  uint32_t until = millis() + hold_ms;
  if (until > drone_tx_active_until_ms) {
    drone_tx_active_until_ms = until;
  }
}

static bool drone_has_manual_input() {
  return (drone_state.throttle > 0) || (abs(drone_state.yaw) > 1) || (abs(drone_state.pitch) > 1) || (abs(drone_state.roll) > 1);
}

static void drone_tx_send_packet() {
  uint8_t oneshot_takeoff = drone_oneshot_takeoff;
  uint8_t oneshot_land = drone_oneshot_land;
  uint8_t oneshot_emergency = drone_oneshot_emergency;
  uint8_t oneshot_calibrate = drone_oneshot_calibrate;

  uint8_t flags = drone_flags_legacy;
  if (oneshot_takeoff > 0) {
    flags |= 0x01;
    drone_oneshot_takeoff--;
  }
  if (oneshot_land > 0) {
    flags |= 0x02;
    drone_oneshot_land--;
  }
  if (oneshot_emergency > 0) {
    flags |= 0x04;
    drone_oneshot_emergency--;
  }
  if (oneshot_calibrate > 0) {
    flags |= 0x80;
    drone_oneshot_calibrate--;
  }

  uint8_t payload[8];
  payload[0] = 0x66;
  payload[1] = drone_axis_centered_from_percent(drone_state.roll);
  payload[2] = drone_axis_centered_from_percent(drone_state.pitch);
  payload[3] = drone_throttle_from_percent(drone_state.throttle);
  payload[4] = drone_axis_centered_from_percent(drone_state.yaw);
  payload[5] = flags;
  payload[6] = drone_checksum_legacy(payload);
  payload[7] = 0x99;

  Serial.write(payload, sizeof(payload));
}

static void drone_tx_task(void *arg) {
  (void)arg;
  const TickType_t period_ticks = pdMS_TO_TICKS(40);  // 25Hz
  while (true) {
    bool has_oneshot = (drone_oneshot_takeoff > 0) || (drone_oneshot_land > 0) || (drone_oneshot_emergency > 0) || (drone_oneshot_calibrate > 0);
    bool has_manual_input = drone_has_manual_input();
    bool is_active = millis() < drone_tx_active_until_ms;
    bool should_send = drone_keepalive_mode || has_oneshot || has_manual_input || is_active;

    if (should_send) {
      drone_tx_send_packet();
    } else {
      drone_tx_has_activity = false;
    }
    vTaskDelay(period_ticks);
  }
}

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size) {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if defined(LED_GPIO_NUM)
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_GPIO_NUM, duty);
  //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

