arjunsk/E88_Wifi_cam_drone_control/ESP32Drone/app_httpd.cpp
  int val = atoi(value);
  sensor_t *s = esp_camera_sensor_get();
  int res = 0;

  if (!strcmp(variable, "framesize")) {
    if (s->pixformat == PIXFORMAT_JPEG) {
      res = s->set_framesize(s, (framesize_t)val);
    }
  } else if (!strcmp(variable, "quality")) {
    res = s->set_quality(s, val);
  } else if (!strcmp(variable, "contrast")) {
    res = s->set_contrast(s, val);
  } else if (!strcmp(variable, "brightness")) {
    res = s->set_brightness(s, val);
  } else if (!strcmp(variable, "saturation")) {
    res = s->set_saturation(s, val);
  } else if (!strcmp(variable, "gainceiling")) {
    res = s->set_gainceiling(s, (gainceiling_t)val);
  } else if (!strcmp(variable, "colorbar")) {
    res = s->set_colorbar(s, val);
  } else if (!strcmp(variable, "awb")) {
    res = s->set_whitebal(s, val);
  } else if (!strcmp(variable, "agc")) {
    res = s->set_gain_ctrl(s, val);
  } else if (!strcmp(variable, "aec")) {
    res = s->set_exposure_ctrl(s, val);
  } else if (!strcmp(variable, "hmirror")) {
    res = s->set_hmirror(s, val);
  } else if (!strcmp(variable, "vflip")) {
    res = s->set_vflip(s, val);
  } else if (!strcmp(variable, "awb_gain")) {
    res = s->set_awb_gain(s, val);
  } else if (!strcmp(variable, "agc_gain")) {
    res = s->set_agc_gain(s, val);
  } else if (!strcmp(variable, "aec_value")) {
    res = s->set_aec_value(s, val);
  } else if (!strcmp(variable, "aec2")) {
    res = s->set_aec2(s, val);
  } else if (!strcmp(variable, "dcw")) {
    res = s->set_dcw(s, val);
  } else if (!strcmp(variable, "bpc")) {
    res = s->set_bpc(s, val);
  } else if (!strcmp(variable, "wpc")) {
    res = s->set_wpc(s, val);
  } else if (!strcmp(variable, "raw_gma")) {
    res = s->set_raw_gma(s, val);
  } else if (!strcmp(variable, "lenc")) {
    res = s->set_lenc(s, val);
  } else if (!strcmp(variable, "special_effect")) {
    res = s->set_special_effect(s, val);
  } else if (!strcmp(variable, "wb_mode")) {
    res = s->set_wb_mode(s, val);
  } else if (!strcmp(variable, "ae_level")) {
    res = s->set_ae_level(s, val);
  } else if (!strcmp(variable, "throttle")) {
    int prev = drone_state.throttle;
    drone_state.throttle = val;
    if (val != prev) {
      if (val != 0) {
        drone_tx_has_activity = true;
        drone_activate_tx(300);
      } else if (prev != 0 && drone_tx_has_activity) {
        // Send neutral frame(s) briefly after stick release, then stop.
        drone_activate_tx(300);
      }
    }
  } else if (!strcmp(variable, "yaw")) {
    int prev = drone_state.yaw;
    drone_state.yaw = val;
    if (val != prev) {
      if (val != 0) {
        drone_tx_has_activity = true;
        drone_activate_tx(300);
      } else if (prev != 0 && drone_tx_has_activity) {
        drone_activate_tx(300);
      }
    }
  } else if (!strcmp(variable, "pitch")) {
    int prev = drone_state.pitch;
    drone_state.pitch = val;
    if (val != prev) {
      if (val != 0) {
        drone_tx_has_activity = true;
        drone_activate_tx(300);
      } else if (prev != 0 && drone_tx_has_activity) {
        drone_activate_tx(300);
      }
    }
  } else if (!strcmp(variable, "roll")) {
    int prev = drone_state.roll;
    drone_state.roll = val;
    if (val != prev) {
      if (val != 0) {
        drone_tx_has_activity = true;
        drone_activate_tx(300);
      } else if (prev != 0 && drone_tx_has_activity) {
        drone_activate_tx(300);
      }
    }
  } else if (!strcmp(variable, "emergency")) {
    drone_state.emergency = val;
    if (val > 0) {
      drone_tx_has_activity = true;
      drone_oneshot_emergency = 20;
      drone_activate_tx(1200);
    }
  } else if (!strcmp(variable, "takeoff")) {
    drone_state.takeoff = val;
    if (val > 0) {
      drone_tx_has_activity = true;
      drone_oneshot_takeoff = 20;
      drone_activate_tx(1200);
    }
  } else if (!strcmp(variable, "land")) {
    drone_state.land = val;
    if (val > 0) {
      drone_tx_has_activity = true;
      drone_oneshot_land = 20;
      drone_activate_tx(1200);
    }
  } else if (!strcmp(variable, "calibrate")) {
    drone_state.calibrate = val;
    if (val > 0) {
      drone_tx_has_activity = true;
      drone_oneshot_calibrate = 20;
      drone_activate_tx(1200);
    }
  } else if (!strcmp(variable, "keepalive")) {
    drone_keepalive_mode = (val > 0);
    if (drone_keepalive_mode) {
      drone_tx_has_activity = true;
    }
  }
#if defined(LED_GPIO_NUM)
  else if (!strcmp(variable, "led_intensity")) {
    led_duty = val;
    if (isStreaming) {
      enable_led(true);
    }
  }
#endif
  else {
    log_i("Unknown command: %s", variable);
    res = -1;
  }

  if (res < 0) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static int print_reg(char *p, sensor_t *s, uint16_t reg, uint32_t mask) {
  return sprintf(p, "\"0x%x\":%u,", reg, s->get_reg(s, reg, mask));
}

static esp_err_t status_handler(httpd_req_t *req) {
  static char json_response[1024];

  sensor_t *s = esp_camera_sensor_get();
  char *p = json_response;
  *p++ = '{';

  if (s->id.PID == OV5640_PID || s->id.PID == OV3660_PID) {
    for (int reg = 0x3400; reg < 0x3406; reg += 2) {
      p += print_reg(p, s, reg, 0xFFF);  //12 bit
    }
    p += print_reg(p, s, 0x3406, 0xFF);

    p += print_reg(p, s, 0x3500, 0xFFFF0);  //16 bit
    p += print_reg(p, s, 0x3503, 0xFF);
    p += print_reg(p, s, 0x350a, 0x3FF);   //10 bit
    p += print_reg(p, s, 0x350c, 0xFFFF);  //16 bit

    for (int reg = 0x5480; reg <= 0x5490; reg++) {
      p += print_reg(p, s, reg, 0xFF);
    }

    for (int reg = 0x5380; reg <= 0x538b; reg++) {
      p += print_reg(p, s, reg, 0xFF);
    }

    for (int reg = 0x5580; reg < 0x558a; reg++) {
      p += print_reg(p, s, reg, 0xFF);
    }
    p += print_reg(p, s, 0x558a, 0x1FF);  //9 bit
  } else if (s->id.PID == OV2640_PID) {
    p += print_reg(p, s, 0xd3, 0xFF);
    p += print_reg(p, s, 0x111, 0xFF);
    p += print_reg(p, s, 0x132, 0xFF);
  }

